betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_ddl_tmr.c
/**
  *
  * @file    apm32f4xx_ddl_tmr.c
  * @brief   TMR DDL module driver.
  *
  * @attention
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *
  * 1. Redistributions of source code must retain the above copyright notice,
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of the copyright holder nor the names of its contributors
  *    may be used to endorse or promote products derived from this software without
  *    specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
  * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
  * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
  * IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
  * INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
  * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  * DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE
  * OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED
  * OF THE POSSIBILITY OF SUCH DAMAGE.
  * The original code has been modified by Geehy Semiconductor.
  * Copyright (c) 2016 STMicroelectronics. Copyright (C) 2023-2025 Geehy Semiconductor.
  * All rights reserved.
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  *
  */
#if defined(USE_FULL_DDL_DRIVER)

/* Includes ------------------------------------------------------------------*/
#include "apm32f4xx_ddl_tmr.h"
#include "apm32f4xx_ddl_bus.h"

#ifdef  USE_FULL_ASSERT
  #include "apm32_assert.h"
#else
#ifndef ASSERT_PARAM
    #define ASSERT_PARAM(_PARAM_) ((void)(0U))
#endif
#endif

/** @addtogroup APM32F4xx_DDL_Driver
  * @{
  */

#if defined (TMR1) || defined (TMR2) || defined (TMR3) || defined (TMR4) || defined (TMR5) || defined (TMR6) || defined (TMR7) || defined (TMR8) || defined (TMR9) || defined (TMR10) || defined (TMR11) || defined (TMR12) || defined (TMR13) || defined (TMR14)

/** @addtogroup TMR_DDL
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/
/** @addtogroup TMR_DDL_Private_Macros
  * @{
  */
#define IS_DDL_TMR_COUNTERMODE(__VALUE__) (((__VALUE__) == DDL_TMR_COUNTERMODE_UP) \
                                          || ((__VALUE__) == DDL_TMR_COUNTERMODE_DOWN) \
                                          || ((__VALUE__) == DDL_TMR_COUNTERMODE_CENTER_UP) \
                                          || ((__VALUE__) == DDL_TMR_COUNTERMODE_CENTER_DOWN) \
                                          || ((__VALUE__) == DDL_TMR_COUNTERMODE_CENTER_UP_DOWN))

#define IS_DDL_TMR_CLOCKDIVISION(__VALUE__) (((__VALUE__) == DDL_TMR_CLOCKDIVISION_DIV1) \
                                            || ((__VALUE__) == DDL_TMR_CLOCKDIVISION_DIV2) \
                                            || ((__VALUE__) == DDL_TMR_CLOCKDIVISION_DIV4))

#define IS_DDL_TMR_OCMODE(__VALUE__) (((__VALUE__) == DDL_TMR_OCMODE_FROZEN) \
                                     || ((__VALUE__) == DDL_TMR_OCMODE_ACTIVE) \
                                     || ((__VALUE__) == DDL_TMR_OCMODE_INACTIVE) \
                                     || ((__VALUE__) == DDL_TMR_OCMODE_TOGGLE) \
                                     || ((__VALUE__) == DDL_TMR_OCMODE_FORCED_INACTIVE) \
                                     || ((__VALUE__) == DDL_TMR_OCMODE_FORCED_ACTIVE) \
                                     || ((__VALUE__) == DDL_TMR_OCMODE_PWM1) \
                                     || ((__VALUE__) == DDL_TMR_OCMODE_PWM2))

#define IS_DDL_TMR_OCSTATE(__VALUE__) (((__VALUE__) == DDL_TMR_OCSTATE_DISABLE) \
                                      || ((__VALUE__) == DDL_TMR_OCSTATE_ENABLE))

#define IS_DDL_TMR_OCPOLARITY(__VALUE__) (((__VALUE__) == DDL_TMR_OCPOLARITY_HIGH) \
                                         || ((__VALUE__) == DDL_TMR_OCPOLARITY_LOW))

#define IS_DDL_TMR_OCIDLESTATE(__VALUE__) (((__VALUE__) == DDL_TMR_OCIDLESTATE_LOW) \
                                          || ((__VALUE__) == DDL_TMR_OCIDLESTATE_HIGH))

#define IS_DDL_TMR_ACTIVEINPUT(__VALUE__) (((__VALUE__) == DDL_TMR_ACTIVEINPUT_DIRECTTI) \
                                          || ((__VALUE__) == DDL_TMR_ACTIVEINPUT_INDIRECTTI) \
                                          || ((__VALUE__) == DDL_TMR_ACTIVEINPUT_TRC))

#define IS_DDL_TMR_ICPSC(__VALUE__) (((__VALUE__) == DDL_TMR_ICPSC_DIV1) \
                                    || ((__VALUE__) == DDL_TMR_ICPSC_DIV2) \
                                    || ((__VALUE__) == DDL_TMR_ICPSC_DIV4) \
                                    || ((__VALUE__) == DDL_TMR_ICPSC_DIV8))

#define IS_DDL_TMR_IC_FILTER(__VALUE__) (((__VALUE__) == DDL_TMR_IC_FILTER_FDIV1) \
                                        || ((__VALUE__) == DDL_TMR_IC_FILTER_FDIV1_N2) \
                                        || ((__VALUE__) == DDL_TMR_IC_FILTER_FDIV1_N4) \
                                        || ((__VALUE__) == DDL_TMR_IC_FILTER_FDIV1_N8) \
                                        || ((__VALUE__) == DDL_TMR_IC_FILTER_FDIV2_N6) \
                                        || ((__VALUE__) == DDL_TMR_IC_FILTER_FDIV2_N8) \
                                        || ((__VALUE__) == DDL_TMR_IC_FILTER_FDIV4_N6) \
                                        || ((__VALUE__) == DDL_TMR_IC_FILTER_FDIV4_N8) \
                                        || ((__VALUE__) == DDL_TMR_IC_FILTER_FDIV8_N6) \
                                        || ((__VALUE__) == DDL_TMR_IC_FILTER_FDIV8_N8) \
                                        || ((__VALUE__) == DDL_TMR_IC_FILTER_FDIV16_N5) \
                                        || ((__VALUE__) == DDL_TMR_IC_FILTER_FDIV16_N6) \
                                        || ((__VALUE__) == DDL_TMR_IC_FILTER_FDIV16_N8) \
                                        || ((__VALUE__) == DDL_TMR_IC_FILTER_FDIV32_N5) \
                                        || ((__VALUE__) == DDL_TMR_IC_FILTER_FDIV32_N6) \
                                        || ((__VALUE__) == DDL_TMR_IC_FILTER_FDIV32_N8))

#define IS_DDL_TMR_IC_POLARITY(__VALUE__) (((__VALUE__) == DDL_TMR_IC_POLARITY_RISING) \
                                          || ((__VALUE__) == DDL_TMR_IC_POLARITY_FALLING) \
                                          || ((__VALUE__) == DDL_TMR_IC_POLARITY_BOTHEDGE))

#define IS_DDL_TMR_ENCODERMODE(__VALUE__) (((__VALUE__) == DDL_TMR_ENCODERMODE_X2_TI1) \
                                          || ((__VALUE__) == DDL_TMR_ENCODERMODE_X2_TI2) \
                                          || ((__VALUE__) == DDL_TMR_ENCODERMODE_X4_TI12))

#define IS_DDL_TMR_IC_POLARITY_ENCODER(__VALUE__) (((__VALUE__) == DDL_TMR_IC_POLARITY_RISING) \
                                                  || ((__VALUE__) == DDL_TMR_IC_POLARITY_FALLING))

