betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_ddl_tmr.c
#define IS_DDL_TMR_OSSR_STATE(__VALUE__) (((__VALUE__) == DDL_TMR_OSSR_DISABLE) \
                                         || ((__VALUE__) == DDL_TMR_OSSR_ENABLE))

#define IS_DDL_TMR_OSSI_STATE(__VALUE__) (((__VALUE__) == DDL_TMR_OSSI_DISABLE) \
                                         || ((__VALUE__) == DDL_TMR_OSSI_ENABLE))

#define IS_DDL_TMR_LOCK_LEVEL(__VALUE__) (((__VALUE__) == DDL_TMR_LOCKLEVEL_OFF) \
                                         || ((__VALUE__) == DDL_TMR_LOCKLEVEL_1)   \
                                         || ((__VALUE__) == DDL_TMR_LOCKLEVEL_2)   \
                                         || ((__VALUE__) == DDL_TMR_LOCKLEVEL_3))

#define IS_DDL_TMR_BREAK_STATE(__VALUE__) (((__VALUE__) == DDL_TMR_BREAK_DISABLE) \
                                          || ((__VALUE__) == DDL_TMR_BREAK_ENABLE))

#define IS_DDL_TMR_BREAK_POLARITY(__VALUE__) (((__VALUE__) == DDL_TMR_BREAK_POLARITY_LOW) \
                                             || ((__VALUE__) == DDL_TMR_BREAK_POLARITY_HIGH))

#define IS_DDL_TMR_AUTOMATIC_OUTPUT_STATE(__VALUE__) (((__VALUE__) == DDL_TMR_AUTOMATICOUTPUT_DISABLE) \
                                                     || ((__VALUE__) == DDL_TMR_AUTOMATICOUTPUT_ENABLE))
/**
  * @}
  */


/* Private function prototypes -----------------------------------------------*/
/** @defgroup TMR_DDL_Private_Functions TMR Private Functions
  * @{
  */
static ErrorStatus OC1Config(TMR_TypeDef *TMRx, DDL_TMR_OC_InitTypeDef *TMR_OCInitStruct);
static ErrorStatus OC2Config(TMR_TypeDef *TMRx, DDL_TMR_OC_InitTypeDef *TMR_OCInitStruct);
static ErrorStatus OC3Config(TMR_TypeDef *TMRx, DDL_TMR_OC_InitTypeDef *TMR_OCInitStruct);
static ErrorStatus OC4Config(TMR_TypeDef *TMRx, DDL_TMR_OC_InitTypeDef *TMR_OCInitStruct);
static ErrorStatus IC1Config(TMR_TypeDef *TMRx, DDL_TMR_IC_InitTypeDef *TMR_ICInitStruct);
static ErrorStatus IC2Config(TMR_TypeDef *TMRx, DDL_TMR_IC_InitTypeDef *TMR_ICInitStruct);
static ErrorStatus IC3Config(TMR_TypeDef *TMRx, DDL_TMR_IC_InitTypeDef *TMR_ICInitStruct);
static ErrorStatus IC4Config(TMR_TypeDef *TMRx, DDL_TMR_IC_InitTypeDef *TMR_ICInitStruct);
/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @addtogroup TMR_DDL_Exported_Functions
  * @{
  */

/** @addtogroup TMR_DDL_EF_Init
  * @{
  */

/**
  * @brief  Set TMRx registers to their reset values.
  * @param  TMRx Timer instance
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: TMRx registers are de-initialized
  *          - ERROR: invalid TMRx instance
  */
ErrorStatus DDL_TMR_DeInit(TMR_TypeDef *TMRx)
{
  ErrorStatus result = SUCCESS;

  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_INSTANCE(TMRx));

  if (TMRx == TMR1)
  {
    DDL_APB2_GRP1_ForceReset(DDL_APB2_GRP1_PERIPH_TMR1);
    DDL_APB2_GRP1_ReleaseReset(DDL_APB2_GRP1_PERIPH_TMR1);
  }
#if defined(TMR2)
  else if (TMRx == TMR2)
  {
    DDL_APB1_GRP1_ForceReset(DDL_APB1_GRP1_PERIPH_TMR2);
    DDL_APB1_GRP1_ReleaseReset(DDL_APB1_GRP1_PERIPH_TMR2);
  }
#endif /* TMR2 */
#if defined(TMR3)
  else if (TMRx == TMR3)
  {
    DDL_APB1_GRP1_ForceReset(DDL_APB1_GRP1_PERIPH_TMR3);
    DDL_APB1_GRP1_ReleaseReset(DDL_APB1_GRP1_PERIPH_TMR3);
  }
#endif /* TMR3 */
#if defined(TMR4)
  else if (TMRx == TMR4)
  {
    DDL_APB1_GRP1_ForceReset(DDL_APB1_GRP1_PERIPH_TMR4);
    DDL_APB1_GRP1_ReleaseReset(DDL_APB1_GRP1_PERIPH_TMR4);
  }
#endif /* TMR4 */
#if defined(TMR5)
  else if (TMRx == TMR5)
  {
    DDL_APB1_GRP1_ForceReset(DDL_APB1_GRP1_PERIPH_TMR5);
    DDL_APB1_GRP1_ReleaseReset(DDL_APB1_GRP1_PERIPH_TMR5);
  }
#endif /* TMR5 */
#if defined(TMR6)
  else if (TMRx == TMR6)
  {
    DDL_APB1_GRP1_ForceReset(DDL_APB1_GRP1_PERIPH_TMR6);
    DDL_APB1_GRP1_ReleaseReset(DDL_APB1_GRP1_PERIPH_TMR6);
  }
#endif /* TMR6 */
#if defined (TMR7)
  else if (TMRx == TMR7)
  {
    DDL_APB1_GRP1_ForceReset(DDL_APB1_GRP1_PERIPH_TMR7);
    DDL_APB1_GRP1_ReleaseReset(DDL_APB1_GRP1_PERIPH_TMR7);
  }
#endif /* TMR7 */
#if defined(TMR8)
  else if (TMRx == TMR8)
  {
    DDL_APB2_GRP1_ForceReset(DDL_APB2_GRP1_PERIPH_TMR8);
    DDL_APB2_GRP1_ReleaseReset(DDL_APB2_GRP1_PERIPH_TMR8);
  }
#endif /* TMR8 */
#if defined(TMR9)
  else if (TMRx == TMR9)
  {
    DDL_APB2_GRP1_ForceReset(DDL_APB2_GRP1_PERIPH_TMR9);
    DDL_APB2_GRP1_ReleaseReset(DDL_APB2_GRP1_PERIPH_TMR9);
  }
#endif /* TMR9 */
#if defined(TMR10)
  else if (TMRx == TMR10)
  {
    DDL_APB2_GRP1_ForceReset(DDL_APB2_GRP1_PERIPH_TMR10);
    DDL_APB2_GRP1_ReleaseReset(DDL_APB2_GRP1_PERIPH_TMR10);
  }
#endif /* TMR10 */
#if defined(TMR11)
  else if (TMRx == TMR11)
  {
    DDL_APB2_GRP1_ForceReset(DDL_APB2_GRP1_PERIPH_TMR11);
    DDL_APB2_GRP1_ReleaseReset(DDL_APB2_GRP1_PERIPH_TMR11);
  }
#endif /* TMR11 */
#if defined(TMR12)
  else if (TMRx == TMR12)
  {
    DDL_APB1_GRP1_ForceReset(DDL_APB1_GRP1_PERIPH_TMR12);
    DDL_APB1_GRP1_ReleaseReset(DDL_APB1_GRP1_PERIPH_TMR12);
  }
#endif /* TMR12 */
#if defined(TMR13)
  else if (TMRx == TMR13)
  {
    DDL_APB1_GRP1_ForceReset(DDL_APB1_GRP1_PERIPH_TMR13);
    DDL_APB1_GRP1_ReleaseReset(DDL_APB1_GRP1_PERIPH_TMR13);
  }
#endif /* TMR13 */
#if defined(TMR14)
  else if (TMRx == TMR14)
  {
    DDL_APB1_GRP1_ForceReset(DDL_APB1_GRP1_PERIPH_TMR14);
    DDL_APB1_GRP1_ReleaseReset(DDL_APB1_GRP1_PERIPH_TMR14);
  }
#endif /* TMR14 */
  else
  {
    result = ERROR;
  }

  return result;
}

/**
  * @brief  Set the fields of the time base unit configuration data structure
  *         to their default values.
  * @param  TMR_InitStruct pointer to a @ref DDL_TMR_InitTypeDef structure (time base unit configuration data structure)
  * @retval None
  */
void DDL_TMR_StructInit(DDL_TMR_InitTypeDef *TMR_InitStruct)
{
  /* Set the default configuration */
  TMR_InitStruct->Prescaler         = (uint16_t)0x0000;
  TMR_InitStruct->CounterMode       = DDL_TMR_COUNTERMODE_UP;
  TMR_InitStruct->Autoreload        = 0xFFFFFFFFU;
  TMR_InitStruct->ClockDivision     = DDL_TMR_CLOCKDIVISION_DIV1;
  TMR_InitStruct->RepetitionCounter = 0x00000000U;
}

/**
  * @brief  Configure the TMRx time base unit.
  * @param  TMRx Timer Instance
  * @param  TMR_InitStruct pointer to a @ref DDL_TMR_InitTypeDef structure
  *         (TMRx time base unit configuration data structure)
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: TMRx registers are de-initialized
  *          - ERROR: not applicable
  */
ErrorStatus DDL_TMR_Init(TMR_TypeDef *TMRx, DDL_TMR_InitTypeDef *TMR_InitStruct)
{
  uint32_t tmpcr1;

  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_INSTANCE(TMRx));
  ASSERT_PARAM(IS_DDL_TMR_COUNTERMODE(TMR_InitStruct->CounterMode));
  ASSERT_PARAM(IS_DDL_TMR_CLOCKDIVISION(TMR_InitStruct->ClockDivision));

  tmpcr1 = DDL_TMR_ReadReg(TMRx, CTRL1);

  if (IS_TMR_COUNTER_MODE_SELECT_INSTANCE(TMRx))
  {
    /* Select the Counter Mode */
    MODIFY_REG(tmpcr1, (TMR_CTRL1_CNTDIR | TMR_CTRL1_CAMSEL), TMR_InitStruct->CounterMode);
  }

  if (IS_TMR_CLOCK_DIVISION_INSTANCE(TMRx))
  {
    /* Set the clock division */
    MODIFY_REG(tmpcr1, TMR_CTRL1_CLKDIV, TMR_InitStruct->ClockDivision);
  }

  /* Write to TMRx CTRL1 */
  DDL_TMR_WriteReg(TMRx, CTRL1, tmpcr1);

  /* Set the Autoreload value */
  DDL_TMR_SetAutoReload(TMRx, TMR_InitStruct->Autoreload);

