betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_ddl_tmr.c
  /* Select the Polarity and set the CC3E Bit */
  MODIFY_REG(TMRx->CCEN,
             (TMR_CCEN_CC3POL | TMR_CCEN_CC3NPOL),
             ((TMR_ICInitStruct->ICPolarity << 8U) | TMR_CCEN_CC3EN));

  return SUCCESS;
}

/**
  * @brief  Configure the TMRx input channel 4.
  * @param  TMRx Timer Instance
  * @param  TMR_ICInitStruct pointer to the the TMRx input channel 4 configuration data structure
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: TMRx registers are de-initialized
  *          - ERROR: not applicable
  */
static ErrorStatus IC4Config(TMR_TypeDef *TMRx, DDL_TMR_IC_InitTypeDef *TMR_ICInitStruct)
{
  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_CC4_INSTANCE(TMRx));
  ASSERT_PARAM(IS_DDL_TMR_IC_POLARITY(TMR_ICInitStruct->ICPolarity));
  ASSERT_PARAM(IS_DDL_TMR_ACTIVEINPUT(TMR_ICInitStruct->ICActiveInput));
  ASSERT_PARAM(IS_DDL_TMR_ICPSC(TMR_ICInitStruct->ICPrescaler));
  ASSERT_PARAM(IS_DDL_TMR_IC_FILTER(TMR_ICInitStruct->ICFilter));

  /* Disable the Channel 4: Reset the CC4E Bit */
  TMRx->CCEN &= (uint32_t)~TMR_CCEN_CC4EN;

  /* Select the Input and set the filter and the prescaler value */
  MODIFY_REG(TMRx->CCM2,
             (TMR_CCM2_CC4SEL | TMR_CCM2_IC4F | TMR_CCM2_IC4PSC),
             (TMR_ICInitStruct->ICActiveInput | TMR_ICInitStruct->ICFilter | TMR_ICInitStruct->ICPrescaler) >> 8U);

  /* Select the Polarity and set the CC4E Bit */
  MODIFY_REG(TMRx->CCEN,
             (TMR_CCEN_CC4POL | TMR_CCEN_CC4NPOL),
             ((TMR_ICInitStruct->ICPolarity << 12U) | TMR_CCEN_CC4EN));

  return SUCCESS;
}


/**
  * @}
  */

/**
  * @}
  */

#endif /* TMR1 || TMR2 || TMR3 || TMR4 || TMR5 || TMR6 || TMR7 || TMR8 || TMR9 || TMR10 || TMR11 || TMR12 || TMR13 || TMR14 */

/**
  * @}
  */

#endif /* USE_FULL_DDL_DRIVER */

